package ru.job4j.course.oop.story;

/**В нашей истории будут три персонажа. Петя, Красная шапочка и Волк.
 * Распишем, как они взаимодействуют друг с другом.
 * В каждый класс мы добавили методы, которые принимают в качестве параметров другой класс.
 * Любой созданный класс - это новый тип данных.
 * Этот новый тип данных можно принимать как параметр, возвращать как параметр.
 */
public class Girl {
    /**Красная шапочка может позвать на помощь Петю.*/
    public void help(Pioneer pioneer) {
    }
}
